<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5a92fb6db4a883260d4c93abcba9a5d896cb55dc1d895a942f44bf2a93f6cc4e","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1182 at https://github.com/cal-itp/data-infra/actions/runs/20148670304","plan_out_hash":"9fa73f7efae041f593d240d7fdb2850a9e0c91ac34abba1d0e487fb088338caa","plan_hash":"706a54e4f3b87e646afc33b3cf63a57d18bd433f0f14ede988a596f9baab0e06","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/transit_database/_int_transit_database.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "rf9oLA==" -> (known after apply)
!~      detect_md5hash      = "8bh4w4EQU4VN/a2TOCFqzg==" -> "different hash"
!~      generation          = 1751416666170213 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/transit_database/_int_transit_database.yml"
!~      md5hash             = "8bh4w4EQU4VN/a2TOCFqzg==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/transit_database/_int_transit_database.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/transit_database/int_transit_database__uri_changelog.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/intermediate/transit_database/int_transit_database__uri_changelog.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/intermediate/transit_database/int_transit_database__uri_changelog.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/transit_database/_mart_transit_database.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "+eUReA==" -> (known after apply)
!~      detect_md5hash      = "RXzI5e+OjKfg27nxHRid3g==" -> "different hash"
!~      generation          = 1757531130467969 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/transit_database/_mart_transit_database.yml"
!~      md5hash             = "RXzI5e+OjKfg27nxHRid3g==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database/_mart_transit_database.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/transit_database/dim_uri_changelog.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/transit_database/dim_uri_changelog.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/transit_database/dim_uri_changelog.sql"
+       storage_class  = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1182](https://github.com/cal-itp/data-infra/actions/runs/20148670304)